SrvrtsRefDOCMGRDEMO/src/InformationRegisters/ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом/ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом</name>
  <resources>
    <name>ОтметкаВремени</name>
    <type>
      <types>DefinedType.ОтметкаВремени</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>EnumRef.ВидыНастроекОбменаСМобильнымКлиентом</types>
      <types>EnumRef.ОбменСМобильнымиТипыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SrvrtsRefDOCMGRDEMO/src/InformationRegisters/ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом/ManagerModule.bsl
// Делает запись об изменившейся насторойке для текущего пользователя
Процедура ДобавитьЗапись(Пользователь, Настройка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписиИзмененныхНастроек = 
		РегистрыСведений.ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.СоздатьМенеджерЗаписи();
	МенеджерЗаписиИзмененныхНастроек.Пользователь = Пользователь;
	МенеджерЗаписиИзмененныхНастроек.Настройка = Настройка;
	МенеджерЗаписиИзмененныхНастроек.ОтметкаВремени = ОтметкиВремени.Текущая();
	МенеджерЗаписиИзмененныхНастроек.Записать();
	
КонецПроцедуры
